export default function Privacy() {
  return (
    <div className="privacy">
      <h1>隐私政策</h1>

      <p>感谢您选择使用我们提供的服务，我们深知这项责任事关重大，我们将致力于保护您的个人信息和隐私权。</p>
      <p>我们非常注重未成年人的个人信息与隐私权保护，因此：</p>
      <p>• 若您为未成年人，应在监护人监护、指导下阅读本协议，并且使用我们的应用 / 服务已经得到监护人的同意.</p>
      <p>• 若您是未成年人的监护人，应指导其上网应该注意的安全问题。若您同意未成年人使用我们的应用 / 服务，必须以您名义申请交易或办理消费（如涉及），并对未成年人使用我们的应用 / 服务进行正确引导、监督。<strong>未成年人通过您的账户使用我们的应用 / 服务，以及行使和履行本协议项下的权利和义务即视为已获得了您的认可。</strong></p>

      <h2>我们会获取以下权限：</h2>
      <p>• <strong>地理位置权限</strong> 在获得您的允许后，我们会获取您的地理位置权限。</p>
      <p>在饭点儿中，地理位置信息仅用于帮助应用准确的统计您位置周边3000M范围内步行可以到达的饭馆数据，并且不存储任何数据信息。有在获得您的允许之前，我们不会读取地理位置的任何数据，您可以在任何时候在系统设置中撤回您对我们读取地理位置权限的授权。</p>

      <h2>我们会更新隐私政策吗？</h2>
      <p>我们会不时修订本隐私权政策。未经您明确同意，我们不会减降您按照本隐私权政策的规定所享有的权利。我们一律会指明最后所做更改的发布日期，以供您查阅。对于重大变更，我们会向您发出郑重通知（包括对于某些服务，我们会通过消息通知，说明对隐私权政策进行的更改）。</p>
      
      <h2>在哪些国家或地区可以使用我们的应用/服务？</h2>
      <p>目前只在中华人民共和国国内使用我们的应用/服务</p>
      
      <h2>如何与我们联系？</h2>
      <p>如果您对隐私政策有任何疑虑，请通过 <a href="mailto:support@crazykids.tech">support@crazykids.tech</a> 与我们联系。</p>
    </div>
  );
}